In [ ]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
pd.__version__

'1.2.4'

In [ ]:
df = pd.read_excel('D:/Kuliah/SISTEM-CERDAS/dataset_soal02.xls')

In [ ]:
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty
0        A            5            1         0  250
1        B            3            1         1  200
2        C            1            1         0   75
3        D            4            1         1  400
4        E            4            0         0  150
5        F            2            0         0   50

In [ ]:
import math 
dis = []
for i in range(6):
    dis.append(math.sqrt((float(df.iloc[i]['Weather V-1'])-4)**2
                         +(float(df.iloc[i]['Holiday V-2'])- 1)**2
                         +(float(df.iloc[i]['Game V-3'])-1)**2))

In [ ]:
df['dis'] = dis
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  1.414214
1        B            3            1         1  200  1.000000
2        C            1            1         0   75  3.162278
3        D            4            1         1  400  0.000000
4        E            4            0         0  150  1.414214
5        F            2            0         0   50  2.449490

In [ ]:
df.sort_values('dis').head(4)

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
3        D            4            1         1  400  0.000000
1        B            3            1         1  200  1.000000
0        A            5            1         0  250  1.414214
4        E            4            0         0  150  1.414214

In [ ]:
y = df.sort_values('dis').head(4)

In [ ]:
z = y["Qty"]
z

3    400
1    200
0    250
4    150
Name: Qty, dtype: int64

In [ ]:
np.mean(z)

250.0